uhnp/src/Enums/ВариантыОтраженияКорректировокРеализаций/ВариантыОтраженияКорректировокРеализаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыОтраженияКорректировокРеализаций</name>
  <enumValues>
    <name>ОтразитьНаПрочихДоходах</name>
  </enumValues>
  <enumValues>
    <name>УвеличитьРеализацию</name>
  </enumValues>
  <enumValues>
    <name>УвеличитьРеализациюУменьшитьСкладскиеОстатки</name>
  </enumValues>
  <enumValues>
    <name>УвеличитьРеализациюУчестьПриИнвентаризации</name>
  </enumValues>
  <enumValues>
    <name>СписатьНаРасходы</name>
  </enumValues>
  <enumValues>
    <name>УменьшитьРеализацию</name>
  </enumValues>
  <enumValues>
    <name>УменьшитьРеализациюСписатьНаРасходы</name>
  </enumValues>
  <enumValues>
    <name>УменьшитьРеализациюУвеличитьСкладскиеОстатки</name>
  </enumValues>
  <enumValues>
    <name>УменьшитьРеализациюУчестьПриИнвентаризации</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВариантыОтраженияКорректировокРеализаций/Forms/ФормаВыбора/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ТекстПояснения = "";
	
	Если Параметры.Отбор.Свойство("Ссылка")
	 И ТипЗнч(Параметры.Отбор.Ссылка) = Тип("СписокЗначений") Тогда
	 	
	 	ДоступныеВарианты = Параметры.Отбор.Ссылка;
		Если ДоступныеВарианты.НайтиПоЗначению(Перечисления.ВариантыОтраженияКорректировокРеализаций.УвеличитьРеализациюУчестьПриИнвентаризации) <> Неопределено Тогда
			ТекстПояснения = НСтр("ru = 'Количество товара по документу больше. Используется ордерная схема при отражении излишков и недостач.';
									|en = 'Quantity of goods against the document is greater. Warehouse management is used to record surpluses and shortages.'") + Символы.ПС + Символы.ПС;
		ИначеЕсли ДоступныеВарианты.НайтиПоЗначению(Перечисления.ВариантыОтраженияКорректировокРеализаций.УвеличитьРеализациюУменьшитьСкладскиеОстатки) <> Неопределено Тогда
			ТекстПояснения = НСтр("ru = 'Количество товара по документу больше. Не используется ордерная схема при отражении излишков и недостач.';
									|en = 'Quantity of goods against the document is greater. Warehouse management is not used to record surpluses and shortages.'") + Символы.ПС + Символы.ПС;
		ИначеЕсли ДоступныеВарианты.НайтиПоЗначению(Перечисления.ВариантыОтраженияКорректировокРеализаций.УменьшитьРеализациюУчестьПриИнвентаризации) <> Неопределено Тогда
			ТекстПояснения = НСтр("ru = 'Количество товара по документу меньше. Используется ордерная схема при отражении излишков и недостач.';
									|en = 'Quantity of goods against the document is less. Warehouse management is used to record surpluses and shortages.'") + Символы.ПС + Символы.ПС;
		ИначеЕсли ДоступныеВарианты.НайтиПоЗначению(Перечисления.ВариантыОтраженияКорректировокРеализаций.УменьшитьРеализациюУвеличитьСкладскиеОстатки) <> Неопределено Тогда
			ТекстПояснения = НСтр("ru = 'Количество товара по документу меньше. Не используется ордерная схема при отражении излишков и недостач.';
									|en = 'Quantity of goods against the document is less. Warehouse management is not used to record surpluses and shortages.'") + Символы.ПС + Символы.ПС;
		КонецЕсли;
		
	КонецЕсли;
	
	ТекстПояснения = ТекстПояснения + НСтр("ru = 'Выберите вариант отражения расхождений:';
											|en = 'Select a discrepancy posting option:'");
	
КонецПроцедуры

#КонецОбласти
